import { LinkCard } from 'types/linkCard';

export const comics: LinkCard[] = [
  {
    id: 1,
    name: 'Люди Икс: Дни минувшего будущего',
    image_url:
      'https://comicvine.gamespot.com/a/uploads/screen_kubrick/0/40/3839144-x-men141_1280.png.jpg',
    description:
      'В будущем — лагерь для интернированных, где живут мутанты, лишившиеся свободы. В настоящем — непрекращающееся противостояние с Братством злых мутантов во главе с Магнето. В прошлом — возможность предотвратить господство Стражей, а значит, грядущую для мутантов изоляцию. Благодаря своим способностям путешествовать во времени, Китти Прайд, живущая в будущем, предупреждает нынешних мутантов о том, что их ждет. Но этого недостаточно, ведь из грядущего в настоящее явились и силы зла.',
    linked_card: {
      1: 'Шторм',
      2: 'Профессор Икс',
      3: 'Циклоп',
      10: 'Росомаха',
      11: 'Джин Грей',
      12: 'Магнето'
    }
  },
  {
    id: 2,
    name: 'Люди Икс: Первый класс',
    image_url:
      'http://img.comicsonline24.ru/comics2/1/allnewxmen2013/001/1.png',
    description:
      'Фантастический комикс, повествующий о противоборстве мутантов-людей Икс и коварного ученого Себастьяна Шоу, решившего ускорить ядерную войну между СССР и Америкой, дабы породить больше людей с паранормальными способностями, а самому стать лидером нового мира.',
    linked_card: {
      1: 'Шторм',
      2: 'Профессор Икс',
      3: 'Циклоп',
      10: 'Росомаха',
      11: 'Джин Грей',
      12: 'Магнето'
    }
  },
  {
    id: 3,
    name: 'Росомаха против мстителей',
    image_url:
      'https://w.forfun.com/fetch/9a/9a0c5225e03130d725a06eeb881f6827.jpeg',
    description:
      'Самый мрачный из людей Икс возвращается на страницы комиксов, чтобы уничтожить еще несколько сотен злодеев и наконец обрести душевный покой. Увидеть духовное перерождение Росомахи дорогого стоит... В небольшой бар заходит высокий человек в капюшоне. Его на редкость подозрительный вид и грубые манеры привлекают внимание наиболее несдержанных посетителей. Назревает конфликт. Когда незнакомец неожиданно выпускает огромные когти, а его противники мысленно уже начинают готовиться к смерти, между ними встает привлекательная девушка. Ничуть не испугавшись Росомахи, она с ходу заявляет, что искала того целый год по просьбе отца, к которому они вместе тут же отправляются. Так начинается самый необычный и сложный период в жизни Росомахи, описанный в ограниченной серии комиксов Marvel 1982 года. Впервые в жизни Росомахе предстоит стать уязвимым, но именно это и поможет ему обрести настоящую, доселе невиданную мощь.',
    linked_card: {
      2: 'Профессор Икс',
      4: 'Железный человек',
      5: 'Черная вдова',
      6: 'Тор',
      7: 'Человек-паук',
      8: 'Капитан Америка',
      10: 'Росомаха'
    }
  },
  {
    id: 4,
    name: 'Чарльз и Эрик',
    image_url: 'https://i.ytimg.com/vi/9qbPXDVKjMY/maxresdefault.jpg',
    description:
      'Люди Икс-это военизированная группа мутантов, которая борется за мир и равенство между нормальными людьми и мутантами. Их возглавляет Чарльз Ксавье, также известный как профессор Икс, могущественный телепат. Профессор Икс управляет школой для детей-мутантов из своего особняка в Вестчестере, штат Нью-Йорк, который тайно также является штаб-квартирой Людей Икс.',
    linked_card: {
      2: 'Профессор Икс',
      10: 'Росомаха',
      12: 'Магнито'
    }
  },
  {
    id: 5,
    name: 'Темный феникс: Восхождение',
    image_url:
      'https://spiralcomics.com/blog/wp-content/uploads/2017/10/OCT170824_crop.jpg',
    description:
      'История Джин Грей, которая разворачивается в тот момент, когда героиня превращается в культового Тёмного Феникса. Во время опасной для жизни спасательной миссии в космосе девушка оказывается поражена таинственной космической силой, которая превращает её в одного из самых могущественных мутантов. В борьбе с этой всё более изменчивой мощью и со своими собственными демонами Джин выходит из-под контроля: раскалывает семью Людей Икс и угрожает уничтожить всю нашу планету.',
    linked_card: {
      1: 'Шторм',
      2: 'Профессор Икс',
      3: 'Циклоп',
      6: 'Тор',
      10: 'Человек-паук',
      11: 'Джин Грей',
      12: 'Магнито'
    }
  },
  {
    id: 6,
    name: 'Железный человек: Возвращение Мандарина',
    image_url:
      'https://i1.wp.com/somewhatnerdy.com/wp-content/uploads/2014/02/iron_man_vs__the_mandarin_by_bennyfuentes-d5hhu8a.jpg',
    description:
      'Когда мир Старка рушится на его глазах по вине неизвестных противников, Тони жаждет найти виновных и свести с ними счеты. Оказавшись в безвыходной ситуации, Старк может рассчитывать только на себя и свою изобретательность, чтобы защитить тех, кто ему дорог. Это становится настоящим испытанием для героя, которому придется не только сражаться с коварным врагом, но и разобраться в себе, чтобы найти ответ на вопрос, который давно его тревожит: что важнее - человек или костюм?',
    linked_card: {
      4: 'Железный человек',
      5: 'Черная вдова',
      7: 'Человек-паук',
      8: 'Капитан Америка',
      9: 'Черная пантера'
    }
  },
  {
    id: 7,
    name: 'Мстители: Война бесконечности',
    image_url:
      'https://www.comicverso.com/wp-content/uploads/2021/09/El-guantelete-del-infinito-destacada.jpg',
    description:
      'Пока Мстители и их союзники продолжают защищать мир от различных опасностей, с которыми не смог бы справиться один супергерой, новая угроза возникает из космоса: Танос. Межгалактический тиран преследует цель собрать все шесть Камней Бесконечности - артефакты невероятной силы, с помощью которых можно менять реальность по своему желанию. Всё, с чем Мстители сталкивались ранее, вело к этому моменту – судьба Земли никогда ещё не была столь неопределённой.',
    linked_card: {
      4: 'Железный человек',
      5: 'Черная вдова',
      6: 'Тор',
      7: 'Человек-паук',
      8: 'Капитан Америка',
      9: 'Черная пантера'
    }
  },
  {
    id: 8,
    name: 'Тор: Рагнарек',
    image_url:
      'https://i.pinimg.com/originals/c5/84/4b/c5844bc634367c40c467ece7dc4a4a19.jpg',
    description:
      'Вернувшись в Асгард в поисках таинственного врага, ведущего охоту на Камни Бесконечности, Тор обнаруживает, что действия его брата Локи, захватившего трон Асгарда, привели к приближению наиболее страшного события - Рагнарёка. По легенде это ознаменует последнюю битву Асгарда, последствием которой станет его полное уничтожение. В попытке предотвратить это событие Тору предстоит прибегнуть к помощи своего товарища из Мстителей - Халка. Вместе им предстоит столкнуться лицом к лицу со злейшим врагом всех девяти миров - огненным демоном Суртуром, целью которого является исполнение пророчества о Рагнарёке и уничтожение девяти миров.',
    linked_card: {
      6: 'Тор'
    }
  },
  {
    id: 9,
    name: 'Человек-паук: Нет пути домой',
    image_url:
      'https://w.forfun.com/fetch/a4/a41a64c5ce7859a47213b627b0149887.jpeg',
    description:
      'Жизнь и репутация Питера Паркера оказываются под угрозой, поскольку Мистерио раскрыл всему миру тайну личности Человека-паука. Пытаясь исправить ситуацию, Питер обращается за помощью к Стивену Стрэнджу, но вскоре всё становится намного опаснее.',
    linked_card: {
      4: 'Железный человек',
      7: 'Человек-паук'
    }
  },
  {
    id: 10,
    name: 'Ваканда навеки',
    image_url:
      'http://multiversitystatic.s3.amazonaws.com/uploads/2020/11/King-in-Black-Black-Panther-featured-1000x700.jpg',
    description:
      'С первого взгляда можно решить, что Ваканда - обычная территория дикой Африки, но это не так. Здесь, в недрах пустынных земель, скрываются залежи уникального металла, способного поглощать вибрацию. Многие пытались добраться до него, разоряя всё на своём пути и принося смерть аборигенам, но каждый раз таинственный дух саванны - Чёрная Пантера - вставал на защиту угнетённых. Спустя много лет беда снова приходит в Ваканду, и в этот раз враг заручился поддержкой современных технологий. Когда шансов почти не остаётся, ТЧалла, молодой принц Ваканды, узнаёт, что именно ему предстоит возродить легенду и продолжить вечную борьбу, надев маску Чёрной Пантеры',
    linked_card: {
      1: 'Шторм',
      9: 'Черная пантера'
    }
  },
  {
    id: 11,
    name: 'Логан',
    image_url:
      'https://img.goodfon.ru/wallpaper/nbig/2/ff/astonishing-x-men-udivitelnye-liudi-iks-marvel-comics-marvel.jpg',
    description:
      'В недалеком будущем уставший от жизни Логан заботится о больном профессоре Икс, который прячется неподалеку от мексиканской границы. Но Логан больше не сможет скрывать свое прошлое, когда встретится с юным мутантом, которого преследуют темные силы.',
    linked_card: {
      2: 'Профессор Икс',
      10: 'Росомаха',
      11: 'Джин Грей'
    }
  }
];
